Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength.#ctor(Autodesk.Revit.DB.ElementId)
Create an arc-length constraint.
paramId:
The Id of a Rebar Shape parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
An arc-length constraint associated with an arc in a RebarShapeDefinition.
Since:
2012